app/controllers/characters_controller.rb

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "The Doctor"], ["description", "There's 13 of them."], ["created_at", "2021-02-07 20:22:06.500042"], ["updated_at", "2021-02-07 20:22:06.500042"]]

  def destroy
    @character.destroy
---
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]